ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_device.c
    if (ep->EP_WaitOut || ep->EP_WaitSetup)
    {
        ep->EP_State = USB_EP_IDLE;
        val |= USB_SEPx_CTRL_EPRDY_Ready; /* Set READY */
    }
    else
    {
        ep->EP_State = USB_EP_NAK;
    }
    ep->EP_Halt = USB_STALL_PROTO;

    USB_EP_SetReady(EPx, val);

    return USB_SUCCESS;
}

/**
  * @brief  Switches the EndPoint to STALL state (protocol stall
  *         or halt) or NAK state, if STALL is prohibited.
  * @note   If protocol stall is ordered, but the EndPoint doesn't accept
  *         SETUP transactions, EndPoint is switched to NAK state.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  bHalt - @ref USB_StallType - Specifies whether the STALL state is a HALT
  *         This parameter can be: USB_STALL_PROTO or USB_STALL_HALT.
  * @retval @ref USB_Result.
  */
USB_Result USB_EP_Stall(USB_EP_TypeDef EPx, USB_StallType bHalt)
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
    uint32_t val = 0;

    if (bHalt == USB_STALL_HALT && EPx == USB_EP0)
    {
        /* No functional stall for Default Control Pipe */
        return USB_ERROR;
    }

    if (bHalt == USB_STALL_HALT || ep->EP_WaitSetup)
    {
        ep->EP_Halt  = bHalt;
        ep->EP_State = USB_EP_STALL;
        val = USB_SEPx_CTRL_EPSSTALL_Reply /* Set STALL reply */
            | USB_SEPx_CTRL_EPRDY_Ready; /* Set READY */
    }

    USB_EP_SetReady(EPx, val);

    return USB_SUCCESS;
}

/**
  * @brief  Indicates that there is data to be sent to the host by this
  *         EndPoint with one or several IN-transactions.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  Buffer: Pointer to the user's buffer with data to be sent.
  * @param  Length: Length of data.
  * @param  onInDone - @ref USB_EP_IO_Handler - User's handler to be called
  *         when data transfer is successfully complete (may be 0).
  * @retval @ref USB_Result.
  */
USB_Result USB_EP_doDataIn(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length, USB_EP_IO_Handler onInDone)
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
    /* Setup IN Data stage starts with DATA1 */
    USB_EPData_Bit_TypeDef StartInStage = (ep->EP_WaitSetup ? USB_DATA_BIT_DATA1 : USB_DATA_BIT_TOGGLE);

    /* Set EndPoint context */
    ep->Buffer.IO_Buffer.pBuffer    = Buffer;
    ep->Buffer.IO_Buffer.length     = Length;
    ep->Buffer.IO_Buffer.bytesToAck = MAX_PACKET_SIZE;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->InHandler                   = onInDone;
    //ep->EP_State                    = USB_EP_IN;

    /* Send first data portion */
    USB_EP_sendInDataPortion(EPx, StartInStage);

    ep->EP_State                    = USB_EP_IN;

    return USB_SUCCESS;
}

/**
  * @brief  Indicates that we are willing to receive Length or more bytes of data
  *         from the host to this EndPoint with OUT transaction(s).
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  Buffer: Pointer to the user's buffer to place received data to.
  *         The total buffer size should be equal or greater then
  *         ((Length / MAX_PACKET_LENGTH) + 1) * MAX_PACKET_LENGTH)
  * @param  Length: The minimal data length to receive before the transfer is
  *         treated as complete.
  * @param  onOutDone - @ref USB_EP_IO_Handler - User's handler to be called
  *         after Length or more bytes of data is successfully received (may be 0).
  * @retval @ref USB_Result.
  */
USB_Result USB_EP_doDataOut(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length, USB_EP_IO_Handler onOutDone)
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* Set EndPoint context */
    ep->Buffer.IO_Buffer.pBuffer    = Buffer;
    ep->Buffer.IO_Buffer.length     = Length;
    ep->Buffer.IO_Buffer.bytesToAck = 0;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->OutHandler                  = onOutDone;
    ep->EP_WaitOut                  = SET;

    /* Start awaiting for OUT transaction */
    USB_EP_Idle(EPx);

    return USB_SUCCESS;
}

/**
  * @brief  Indicates that we are willing to receive (repeatedly) Setup Control
  *         Transactions with this EndPoint.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  USB_SetupPacket: Pointer to the user's buffer to place
  *         received setup packet (@ref USB_SetupPacket_TypeDef).
  * @param  onSetupPacket - @ref USB_EP_Setup_Handler - User's handler to be called
  *         when setup packet is received.
  * @retval @ref USB_Result.
  */
USB_Result USB_EP_setSetupHandler(USB_EP_TypeDef EPx, USB_SetupPacket_TypeDef* USB_SetupPacket, USB_EP_Setup_Handler onSetupPacket)
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* Set EndPoint context */
    ep->Buffer.pSetupPacket         = USB_SetupPacket;
    ep->Buffer.IO_Buffer.length     = 0;
    ep->Buffer.IO_Buffer.bytesToAck = 0;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->SetupHandler                = onSetupPacket;
    ep->EP_WaitSetup                = onSetupPacket ? SET : RESET;

    /* Start awaiting for SETUP transaction */
    USB_EP_Idle(EPx);

    return USB_SUCCESS;
}

/**
  * @brief  EndPoint state machine implementation.
  * @note   This function should be called at appropriate rate to handle possible
  *         EndPoint events.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  USB_IT: SLAVE controller interrupt flags (USB_SIS register value).
  * @retval @ref USB_Result.
  */
USB_Result USB_EP_dispatchEvent(USB_EP_TypeDef EPx, uint32_t USB_IT)
{
    FlagStatus nextIteration = RESET;
    USB_Result result = USB_SUCCESS;
    uint32_t tmpSTS, tmpTS, tmpCTRL;
    uint32_t i, count;
    USB_EPContext_TypeDef *ep;

