ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_device.c
    tmpSTS = USB_GetSEPxSTS(EPx);
    tmpTS  = (USB_GetSEPxTS(EPx) & USB_SEPx_TS_SCTTYPE_Msk);
    tmpCTRL = USB_GetSEPxCTRL(EPx);

    ep = USB_EPContext + EPx;

    /* Remember SCDONE event in the EndPoint context */
    if (USB_IT & USB_SIS_SCTDONE)
    {
        ep->EP_WasScdone = SET;
    }

    do
    {
        switch (ep->EP_State)
        {
            /* USB_EP_NAK */
            case USB_EP_NAK:
            {
                /* Fast return if EndPoint in the NAK state */
                return USB_SUCCESS;
            }

            /* USB_EP_IDLE */
            case USB_EP_IDLE:
            {
                if (!(tmpCTRL & USB_SEP_CTRL_EPRDY) && ep->EP_WasScdone)
                {
                    /* EPRDY dropped - event for this End Point */
                    if ((tmpTS == USB_SEPx_TS_SCTTYPE_Outdata) && ep->EP_WaitOut)
                    {
                        /* OUT transaction started: switch into the OUT state and continue processing there */
                        ep->EP_State = USB_EP_OUT;
                        ep->EP_WaitOut = RESET;
                        nextIteration = SET;
                    }
                    else if ((tmpTS == USB_SEPx_TS_SCTTYPE_Setup) && ep->EP_WaitSetup)
                    {
                        /* SETUP transaction started: switch into the SETUP state and continue processing there */
                        ep->EP_State = USB_EP_SETUP;
                        nextIteration = SET;
                    }
                    else
                    {
                        /* Unexpected transaction: switch into STALL/NAK state and return error */
                        result = USB_ERROR;
                        USB_EP_Stall(EPx, USB_STALL_PROTO);
                    }
                }
                break;
            }

            /* USB_EP_IN */
            case USB_EP_IN:
            {
                /* Analyze event type */
                if ((!(tmpCTRL & USB_SEP_CTRL_EPRDY)) && ep->EP_WasScdone &&
                    (tmpTS == USB_SEPx_TS_SCTTYPE_In) && (tmpSTS & USB_SEP_STS_SCACKRXED))
                {
                    /* 1. ACK event */
                    ep->Buffer.IO_Buffer.offset += ep->Buffer.IO_Buffer.bytesToAck;
                    if (ep->Buffer.IO_Buffer.offset >= ep->Buffer.IO_Buffer.length)
                    //if (ep->Buffer.IO_Buffer.offset > ep->Buffer.IO_Buffer.length)
                    {
                        /* If offset >= length (transfer is over), indicate it with NAK state
                        * and call handler (if present) */
                        ep->EP_State = USB_EP_NAK;
                        if (ep->InHandler != 0)
                        {
                            result = ep->InHandler(EPx, ep->Buffer.IO_Buffer.pBuffer, ep->Buffer.IO_Buffer.length);
                        }
            
                        if (result == USB_SUCCESS)
                        {
                            /* If no other transaction is ordered by user or no data stage of SETUP
                            * packet (state isn't changed), go to NAK/IDLE state */
                            if (ep->EP_State == USB_EP_NAK)
                            {
                                USB_EP_Idle(EPx);
                            }
                        }
                        else
                        {
                            /* If user's handler indicated error, go to STALL/NAK state */
                            USB_EP_Stall(EPx, USB_STALL_PROTO);
                        }
                    }
                    else
                    {
                        /* If there is any data to send remaining, send next portion */
                        USB_EP_sendInDataPortion(EPx, USB_DATA_BIT_TOGGLE);
                    }
                }
                else if (tmpSTS & (USB_SEP_STS_SCRXOF
                                | USB_SEP_STS_SCCRCERR
                                | USB_SEP_STS_SCBSERR
                                | USB_SEP_STS_SCRXTO))
                {
                    /* 2. Error events - call error handler (if present). Switch temporarily to NAK
                    * to check if user orders another transaction */
                    ep->EP_State = USB_EP_NAK;
                    if (ep->ErrorHandler != 0)
                    {
                        result = ep->ErrorHandler(EPx, tmpSTS, tmpTS, tmpCTRL);
                    }
                    if (result == USB_SUCCESS)
                    {
                        if (ep->EP_State == USB_EP_NAK)
                        {
                            /* If there is no user's handler or USB_SUCCESS returned and no other transaction
                            * is started, retry with current data portion */
                            ep->EP_State = USB_EP_IN;
                            USB_EP_sendInDataPortion(EPx, USB_DATA_BIT_KEEP);
                        }
                    }
                    else
                    {
                        /* If user's handler indicated error, go to STALL/NAK state */
                        USB_EP_Stall(EPx, USB_STALL_PROTO);
                    }
                }
                break;
            }

            /* USB_EP_OUT */
            case USB_EP_OUT:
            {
                /* Check for event */
                if (!(tmpCTRL & USB_SEP_CTRL_EPRDY) && ep->EP_WasScdone)
                {
                    nextIteration = RESET;

                    /* Read data packet */
                    count = USB_GetSEPxRXFDC(EPx);
                    for (i = 0; i < count; i++)
                    {
                        ep->Buffer.IO_Buffer.pBuffer[ep->Buffer.IO_Buffer.offset + i] = EPx_RX_FIFO_DATA(EPx);
                    }
                    RX_FIFO_FORCE_EMPTY(EPx);
                    ep->Buffer.IO_Buffer.offset += count;

                    /* If offset >= length (transfer is over), indicate it with NAK state
                    * and call handler (if present) */
                    if (ep->Buffer.IO_Buffer.offset >= ep->Buffer.IO_Buffer.length)
                    {
                        ep->EP_State = USB_EP_NAK;
                        if (ep->OutHandler != 0)
                        {
                            result = ep->OutHandler(EPx, ep->Buffer.IO_Buffer.pBuffer, ep->Buffer.IO_Buffer.offset);
                        }

                        if (result == USB_SUCCESS)
                        {
                            /* If no other transaction is ordered by user or no data stage of SETUP
                            * packet (state isn't changed), go to NAK/IDLE state */
                            if (ep->EP_State == USB_EP_NAK)
                            {
                                USB_EP_Idle(EPx);
                            }
                        }
                        else
                        {
                            /* If user's handler indicated error, go to STALL/NAK state */
                            USB_EP_Stall(EPx, USB_STALL_PROTO);
                        }
                    }
                    else
                    {
                        /* If offset < length, wait for another portion */
                        USB_EP_SetReady(EPx, USB_SEPx_CTRL_EPRDY_Ready);
                    }
                }
                break;
            }

            /* USB_EP_SETUP */
            case USB_EP_SETUP:
            {
                /* Check for event */
                if (ep->EP_WasScdone)
                {
                    assert_param(ep->SetupHandler);

                    /* Read setup packet and check for correct size (8 bytes) */
                    count = USB_GetSEPxRXFDC(EPx);
                    if (count == 8)
                    {
                        for (i = 0; i < count; i++)
                        {
                            ((uint8_t*)ep->Buffer.pSetupPacket)[i] = EPx_RX_FIFO_DATA(EPx);
                        }
                        RX_FIFO_FORCE_EMPTY(EPx);

                        /* Call the handler */
                        result = ep->SetupHandler(EPx, ep->Buffer.pSetupPacket);

                        if (result == USB_SUCCESS)
                        {
                            /* If no other transaction is ordered by user or no data stage of SETUP
                            * packet (state isn't changed), go to NAK/IDLE state */
                            if (ep->EP_State == USB_EP_SETUP)
                            {
                                USB_EP_Idle(EPx);
                            }
                        }
                        else
                        {
                            /* If user's handler indicated error, go to STALL/NAK state */
                            USB_EP_Stall(EPx, USB_STALL_PROTO);
                        }
                    }
                    else /* Incorrect packet size */
                    {
                        RX_FIFO_FORCE_EMPTY(EPx);
                        result = USB_ERROR;
                        /* Switch into STALL state */
                        USB_EP_Stall(EPx, USB_STALL_PROTO);
                    }
                }
                nextIteration = RESET;
                break;
            }

            /* USB_EP_STALL */
            case USB_EP_STALL:
            {
                if (!(tmpCTRL & USB_SEP_CTRL_EPRDY))
                {
                    /* EPRDY dropped - event for this End Point */
                    if (ep->EP_Halt == USB_STALL_HALT)
                    {
                        USB_EP_Stall(EPx, USB_STALL_HALT);
                    }
                    else
                    {
                        USB_EP_Idle(EPx);
                    }
                }
                break;
            }
        }
    } while (nextIteration);

    return result;
}

/**
  * @brief  Prepares EndPoint for IN transaction accepting (service function).
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  DataBitChange - @ref USB_EPData_Bit_TypeDef - DATA bit handling.
  *         This parameter can be one of the following values:
  *             @arg USB_DATA_BIT_KEEP: Don't change DATA bit.
  *             @arg USB_DATA_BIT_TOGGLE: Toggle DATA0/DATA1.
  *             @arg USB_DATA_BIT_DATA1: Set DATA1.
  * @retval None.
  */
static void USB_EP_sendInDataPortion(USB_EP_TypeDef EPx, USB_EPData_Bit_TypeDef DataBitChange)
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
    uint32_t i, total;

    assert_param(ep->EP_State == USB_EP_IN);

    /* Clean TX FIFO buffer */
    TX_FIFO_FORCE_EMPTY(EPx);

    /* Adjust DATA bit */
    switch (DataBitChange)
    {
        case USB_DATA_BIT_KEEP:
            break;
        case USB_DATA_BIT_TOGGLE:
            USB_SEPxToggleEPDATASEQ(EPx);
            break;
        case USB_DATA_BIT_DATA1:
            USB_SetSEPxCTRL(EPx, USB_SEPx_CTRL_EPDATASEQ_Data1);
            break;
    }

    /* Copy data portion into TX FIFO buffer */
    total = (ep->Buffer.IO_Buffer.offset + ep->Buffer.IO_Buffer.bytesToAck < ep->Buffer.IO_Buffer.length ?
             ep->Buffer.IO_Buffer.offset + ep->Buffer.IO_Buffer.bytesToAck : ep->Buffer.IO_Buffer.length);
    for (i = ep->Buffer.IO_Buffer.offset; i < total; i++)
    {
        USB_SetSEPxTXFD(EPx, ep->Buffer.IO_Buffer.pBuffer[i]);
    };

    /* Set EPRDY bit */
    USB_EP_SetReady(EPx, USB_SEPx_CTRL_EPRDY_Ready);
}


/**
  * @brief  Sets EPRDY and STALL bits (service function).
  * @note   Before setting EPRDY, the function clears pending
  *         bits (especially SCTDONE), to indicate that previous
  *         transaction is complete.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  val: Value for SEPxCTRL register.
  * @retval None.
  */
static void USB_EP_SetReady(USB_EP_TypeDef EPx, uint32_t val)
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* Clear pending bits */
    USB_SetSIS(USB_SIS_Msk);

