ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_device.c
    ep->EP_WasScdone = RESET;

    /* Set CTRL bits */
    USB_SetSEPxCTRL(EPx, val);
}

/** @} */ /* End of group USB_EndPoint_Private_Functions */

/** @} */ /* End of group USB_EndPoint */

/** @defgroup USB_Device USB Device
  * @{
  */


/** @defgroup USB_Device_Private_Variables USB Device Private Variables
  * @{
  */

USB_SetupPacket_TypeDef USB_CurrentSetupPacket;
USB_DeviceContext_TypeDef USB_DeviceContext;
static uint8_t SetupPacketData[2];

/** @} */ /* End of group USB_Device_Private_Variables */


/** @defgroup USB_Device_Private_FunctionPrototypes USB Device Private Function Prototypes
  * @{
  */

static USB_Result USB_Device_setAddressWork(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length);

/** @} */ /* End of group USB_Device_Private_FunctionPrototypes */

/** @defgroup USB_Device_Private_Functions USB Device Private Functions
  * @{
  */

/**
  * @brief  Initializes the USB peripheral according to the specified
  *         parameters in the USB_Clock_InitStruct.
  * @param  USB_Clock_InitStruct: pointer to a @ref USB_Clock_TypeDef structure
  *         that contains the configuration information for the USB Clock.
  * @param  USB_DeviceBUSParam: pointer to a @ref USB_DeviceBUSParam_TypeDef structure
  *         that contains the configuration information for the USB BUS
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceInit(const USB_Clock_TypeDef* USB_Clock_InitStruct, USB_DeviceBUSParam_TypeDef* USB_DeviceBUSParam)
{
    /* Check the parameters */
    assert_param(IS_USB_PULL(USB_DeviceBUSParam->PULL));
    assert_param(IS_USB_SPEED(USB_DeviceBUSParam->SPEED));
    assert_param(IS_USB_MODE(USB_DeviceBUSParam->MODE));

    /* Set USB clocks perform controller reset */
    USB_BRGInit(USB_Clock_InitStruct);
    USB_Reset();
    /* Set pulls and Device mode */
    USB_SetHSCR(USB_HSCR_HOST_MODE_Device);
    USB_SetHSCR(USB_DeviceBUSParam->PULL);
    /* Set speed, polarity and enable end points */
    USB_SetSC(USB_DeviceBUSParam->SPEED | USB_DeviceBUSParam->MODE | USB_SC_SCGEN_Set);
    /* Setup EP0 */
    USB_EP_Init(USB_EP0, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1, 0);
    USB_EP_setSetupHandler(USB_EP0, &USB_CurrentSetupPacket, USB_DEVICE_HANDLE_SETUP);

    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_UNKNOWN;
    USB_DeviceContext.Address         = 0;

    return USB_SUCCESS;
}

/**
  * @brief  Enables the USB peripheral.
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DevicePowerOn(void)
{
    USB_SetHSCR(USB_HSCR_EN_RX_Set | USB_HSCR_EN_TX_Set);
    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_POWERED;

    return USB_SUCCESS;
}

/**
  * @brief  Disables the USB peripheral.
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DevicePowerOff(void)
{
    USB_SetHSCR(USB_HSCR_EN_RX_Reset);
    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_UNKNOWN;

    return USB_SUCCESS;
}

#ifdef USB_REMOTE_WAKEUP_SUPPORTED

/**
  * @brief  Initiates host remote wakeup
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceRemoteWakeUp(void)
{
    return USB_SUCCESS;
}
#endif /* #ifdef USB_REMOTE_WAKEUP_SUPPORTED */

/** @defgroup USB_Device_Private_Handlers USB Device Handlers implementation
  * @{
  */

/**
  * @brief  Reset bus handler
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceReset(void)
{
    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_DEFAULT;

    return USB_SUCCESS;
}

/**
  * @brief  Performs all necessary actions on entering to SUSPENDED state
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceSuspend(void)
{
    return USB_SUCCESS;
}

/**
  * @brief  Performs all necessary actions on exit from SUSPENDED state
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceResume(void)
{
    return USB_SUCCESS;
}

/**
  * @brief  Control Setup Packet processing dispatcher (set as EP0 setup
  *         packet handler).
  * @note   This function interface reflects EndPoint setup packet handler
  *         requirements. Request setup packet data is placed into
  *         USB_CurrentSetupPacket variable to be accessible from the
  *         specific request type handlers.
  * @param  EPx: USB Control EndPoint (EP0) number.
  * @param  USB_SetupPacket: Pointer to a USB_SetupPacket_TypeDef structure
  *         that contains received setup packet contents (on success)
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceSetupPacket(USB_EP_TypeDef EPx, const USB_SetupPacket_TypeDef* USB_SetupPacket)
{
    USB_RequestType_TypeDef requestType;
    USB_RequestTypeDT_TypeDef requestDirection;

    USB_Result result = USB_SUCCESS;
    uint16_t wValue, wIndex, wLength;

    /* Check the parameters */
    assert_param(IS_USB_ENDPOINT(EPx));

    /* Determine request type */
    requestType = (USB_RequestType_TypeDef)(USB_SetupPacket->mRequestTypeData & USB_REQUEST_TYPE_Msk);
    requestDirection = (USB_RequestTypeDT_TypeDef)(USB_SetupPacket->mRequestTypeData & USB_REQUEST_DT_Msk);

    /* Process request */
    switch (requestType)
    {
        /* Standard request */
        case USB_TYPE_STANDARD:
        {
            USB_RequestRecipient_TypeDef recipient;
            USB_EP_IO_Handler statusAckHandler = 0;

            wValue = USB_SetupPacket->wValue;
            wIndex = USB_SetupPacket->wIndex;
            wLength = USB_SetupPacket->wLength;

            /* Recipient check */
            recipient = (USB_RequestRecipient_TypeDef)(USB_SetupPacket->mRequestTypeData & USB_RECIPIENT_TYPE_Msk);
            if (!IS_VALID_USB_RECIPIENT(recipient))
            {
                result = USB_ERR_INV_REQ;
                break;
            }
            /* Specific requests */
            switch (USB_SetupPacket->bRequest)
            {
                /* GET_STATUS */
                case USB_GET_STATUS:
                    if (requestDirection != USB_DEVICE_TO_HOST ||
                    (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS && (recipient == USB_RECIPIENT_INTERFACE ||
                    (recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints))))
                    {
                        result = USB_ERROR;
                    }
                    else
                    {
                        /* Give user a chance to set flags in the device context */
                        result = USB_DEVICE_HANDLE_GET_STATUS(recipient, wIndex);
                        if (result == USB_SUCCESS)
                        {
                            switch (recipient)
                            {
                                /* Device - return Self Powered and Remote Wakeup status */
                                case USB_RECIPIENT_DEVICE:
                                    SetupPacketData[0] = 0
#ifdef USB_SELF_POWERED_SUPPORTED
                                                       | USB_DeviceContext.USB_DeviceStatus.SelfPowered
#endif /* #ifdef USB_SELF_POWERED_SUPPORTED */
#ifdef USB_REMOTE_WAKEUP_SUPPORTED
                                                       | (USB_DeviceContext.USB_DeviceStatus.RemoteWakeupEnabled << 1)
#endif /* #ifdef USB_REMOTE_WAKEUP_SUPPORTED */
                                                      ;
                                    break;
                                /* Interface - return 0 */
                                case USB_RECIPIENT_INTERFACE:
                                    SetupPacketData[0] = 0;
                                    break;
                                /* Endpoint - return Halt status */
                                case USB_RECIPIENT_ENDPOINT:
                                    SetupPacketData[0] = USB_EPContext[wIndex].EP_Halt;
                                    break;
                                default :
                                    break;
                            }
                            SetupPacketData[1] = 0;
//                          result = USB_EP_doDataIn(EPx, SetupPacketData, 2, 0);
                            result = USB_EP_doDataIn(EPx, SetupPacketData, 2, USB_DeviceDoStatusOutAck);
                        }
                    }
                    break;
                /* CLEAR_FEATURE */
                case USB_CLEAR_FEATURE:
                    if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS && (recipient == USB_RECIPIENT_INTERFACE ||
                    (recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints)))
                    {
                        result = USB_ERROR;
                    }
                    else
                    {
                        result = USB_DEVICE_HANDLE_CLEAR_FEATURE(recipient, wValue, wIndex);
                    }
                    break;
                /* SET_FEATURE */
                case USB_SET_FEATURE:
                    if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS && (recipient == USB_RECIPIENT_INTERFACE ||
                    (recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints)))
                    {
                        result = USB_ERROR;
                    }
                    else
                    {
                        result = USB_DEVICE_HANDLE_SET_FEATURE(recipient, wValue, wIndex);
                    }
                    break;
                /* SET_ADDRESS */
                case USB_SET_ADDRESS:
                    result = USB_DEVICE_HANDLE_SET_ADDRESS(wValue);
                    /* Set special Status Stage handler that will actually change the address */
                    USB_DeviceContext.Address = wValue;
                    statusAckHandler = USB_Device_setAddressWork;
                    break;
                /* GET_DESCRIPTOR */
                case USB_GET_DESCRIPTOR:
                    result = USB_DEVICE_HANDLE_GET_DESCRIPTOR(wValue, wIndex, wLength);
                    break;
                /* SET_DESCRIPTOR */
                case USB_SET_DESCRIPTOR:
                    result = USB_DEVICE_HANDLE_SET_DESCRIPTOR(wValue, wIndex, wLength);
                    break;
                /* GET_CONFIGURATION */
                case USB_GET_CONFIGURATION:
                    if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
                    {
                        SetupPacketData[0] = 0;
                    }
                    else
                    {
                        SetupPacketData[0] = (uint8_t)USB_DEVICE_HANDLE_GET_CONFIGURATION;
                    }
//                  result = USB_EP_doDataIn(EPx, SetupPacketData, 1, 0);
                    result = USB_EP_doDataIn(EPx, SetupPacketData, 1, USB_DeviceDoStatusOutAck);
                    break;
                /* SET_CONFIGURATION */
                case USB_SET_CONFIGURATION:
                    if (wValue == 0)
                    {
                        USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_ADDRESS;
                    }
                    else
                    {
                        result = USB_DEVICE_HANDLE_SET_CONFIGURATION(wValue);
                        if (result == USB_SUCCESS)
                        {
                            USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_CONFIGURED;
                        }
                    }
                    break;
                /* GET_INTERFACE */
                case USB_GET_INTERFACE:
                    if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
                    {
                        result = USB_ERROR;
                    }
                    else
                    {
                        SetupPacketData[0] = (uint8_t)USB_DEVICE_HANDLE_GET_INTERFACE(wIndex);
//                      result = USB_EP_doDataIn(EPx, SetupPacketData, 1, 0);
                        result = USB_EP_doDataIn(EPx, SetupPacketData, 1, USB_DeviceDoStatusOutAck);
                    }
                    break;
                /* SET_INTERFACE */
                case USB_SET_INTERFACE:
                    if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
                    {
                        result = USB_ERROR;
                    }
                    else
                    {
                        result = USB_DEVICE_HANDLE_SET_INTERFACE(wValue, wIndex);
                    }
                    break;
                /* SYNCH_FRAME */
                case USB_SYNCH_FRAME:
                    if (USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS)
                    {
                        result = USB_ERROR;
                    }
                    else
                    {
                        result = USB_DEVICE_HANDLE_SYNC_FRAME(wIndex, SetupPacketData);
                        if (result == USB_SUCCESS)
                        {
//                          result = USB_EP_doDataIn(EPx, SetupPacketData, 2, 0);
                            result = USB_EP_doDataIn(EPx, SetupPacketData, 2, USB_DeviceDoStatusOutAck);
                        }
                    }
                    break;
                default:
                    result = USB_ERR_INV_REQ;
            }
            /* If there were no DATA stage, initiate Status Stage (IN ACK) */
            if (result == USB_SUCCESS && wLength == 0)
            {
                result = (USB_SetupPacket->mRequestTypeData & 0x80) == USB_DEVICE_TO_HOST ?
                            USB_EP_doDataOut(EPx, 0, 0, statusAckHandler) :
                            USB_EP_doDataIn(EPx, 0, 0, statusAckHandler);
            }
            break;
        }
        /* Class-specific request */
        case USB_TYPE_CLASS:
            result = USB_DEVICE_HANDLE_CLASS_REQUEST;
            break;
        /* Vendor-specific request */
        case USB_TYPE_VENDOR:
            result = USB_DEVICE_HANDLE_VENDOR_REQUEST;
            break;
        default:
            result = USB_ERR_INV_REQ;
    }

    return result;
}

