ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/USB_Library/MDR32FxQI_usb_device.c
        bHandling = RESET;

        /* Enable USB interrupts (only after the actual work is done) */
#ifdef USB_INT_HANDLE_REQUIRED
        NVIC_EnableIRQ(USB_IRQn);
#endif /* #ifdef USB_INT_HANDLE_REQUIRED */
    }

    return result;
}

#ifdef USB_INT_HANDLE_REQUIRED
/**
  * @brief  Default implementation of USB interrupt handler
  * @note   To be overwritten, USB_INT_HANDLE_REQUIRED definition should be
  *         undefined.
  * @param  None
  * @retval None
  */
void USB_IRQHandler(void)
{
    USB_DeviceDispatchEvent();
}
#endif /* #ifdef USB_INT_HANDLE_REQUIRED */


/** @defgroup USB_Device_Private_Dummy_Functions USB Device Private Handler Samples
  * @{
  */

/**
  * @brief  GET_STATUS standard request handler sample (9.4.5).
  * @note   Intended to update USB_DeviceStatus field of the device context
  *         before the status to be sent to host. Data stage begins if USB_SUCCESS
  *         is returned.
  * @param  Recipient - @ref USB_RequestRecipient_TypeDef - Recipient type (from setup packet header).
  *         This parameter can be one of the following values:
  *             USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
  *             USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
  * @param  wINDEX: Interface or EndPoint number, if Recipient has
  *         appropriate value.
  * @retval @ref USB_Result.
  *
  */
USB_Result USB_DeviceDummyGetStatus(USB_RequestRecipient_TypeDef Recipient, uint16_t wINDEX)
{
    return USB_SUCCESS;
}

/**
  * @brief  SET_ADDRESS standard request handler (preparation) sample (9.4.6).
  * @note   Intended to do perform actions while still in setup transaction
  *         (actual address change to be performed after status stage completes).
  *         If value returned is not USB_SUCCESS, transaction is aborted.
  * @param  wVALUE: New device address
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummySetAddress(uint16_t wVALUE)
{
    return USB_SUCCESS;
}

/**
  * @brief  GET_DESCRIPTOR standard request handler sample (9.4.3).
  * @note   This handler is called in correct state only. It's to be implemented
  *         in any device class. It is expected to either perform data transfer
  *         and status stages on its own (calling USB_EP_doDataIn), or return
  *         value that is not USB_SUCCESS.
  * @param  wVALUE: Descriptor Type and Descriptor Index
  * @param  wINDEX: Zero or Language ID (see 9.6.7)
  * @param  wLENGTH: Amount of data host is willing to receive.
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummyGetDescriptor(uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH)
{
    return USB_ERROR;
}

/**
  * @brief  SET_DESCRIPTOR standard request handler sample (9.4.8).
  * @note   This handler is called in correct state only. It's to be implemented
  *         only if the device supports descriptor update by host. It is expected
  *         to either perform data transfer and status stages on its own (calling
  *         USB_EP_doDataOut), or return value that is not USB_SUCCESS.
  * @param  wVALUE: Descriptor Type and Descriptor Index
  * @param  wINDEX: Zero or Language ID (see 9.6.7)
  * @param  wLENGTH: Amount of data to be sent by host.
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummySetDescriptor(uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH)
{
    return USB_ERROR;
}

/**
  * @brief  GET_CONFIGURATION standard request handler sample (9.4.2).
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports more than one configuration.
  * @param  None
  * @retval Currently selected configuration number or 0 on error.
  */
uint8_t USB_DeviceDummyGetConfiguration(void)
{
    return 1;
}

/**
  * @brief  SET_CONFIGURATION standard request handler sample (9.4.7).
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports more than one configuration.
  * @param  wVALUE: Configuration number
  * @retval @ref USB_Result
  */
USB_Result USB_DeviceDummySetConfiguration(uint16_t wVALUE)
{
    return USB_ERROR;
}

/**
  * @brief  GET_INTERFACE standard request handler sample (9.4.4).
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports interfaces with alternate settings.
  * @param  wINDEX: Interface number.
  * @retval Currently selected alternate setting for the specified interface
  *         or 0 in case of error.
  */
uint8_t USB_DeviceDummyGetInterface(uint16_t wINDEX)
{
    return 0;
}

/**
  * @brief  SET_INTERFACE standard request handler sample (9.4.10).
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports interfaces with alternate settings.
  * @param  wVALUE: Alternate setting to be set.
  * @param  wINDEX: Interface number.
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummySetInterface(uint16_t wVALUE, uint16_t wINDEX)
{
    return USB_SUCCESS;
}

/**
  * @brief  SYNC_FRAME standard request handler sample (9.4.11).
  * @note   This handler is called in correct state only. It's to be implemented
  *         if some of the device EndPoints support isochronous transfers. It is
  *         expected to place EndPoint synchronization frame number into DATA pointed
  *         location or return value that is not USB_SUCCESS.
  * @param  wINDEX: EndPoint number.
  * @param  DATA: Pointer for frame number.
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummySyncFrame(uint16_t wINDEX, uint8_t* DATA)
{
    return USB_ERROR;
}

/**
  * @brief  Class-type setup request handler sample.
  * @note   This handler is called in correct state only. It's to be implemented
  *         the device supports any class-type requests. Request setup packet data
  *         is accessible by USB_CurrentSetupPacket variable. The overwritten method
  *         should implement both data (if present) and status transfer stages.
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummyClassRequest(void)
{
    return USB_ERROR;
}

/**
  * @brief  Vendor-type setup request handler sample.
  * @note   This handler is called in correct state only. It's to be implemented
  *         the device supports any vendor-type requests. Request setup packet data
  *         is accessible by USB_CurrentSetupPacket variable. The overwritten method
  *         should implement both data (if present) and status transfer stages.
  * @param  None
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummyVendorRequest(void)
{
    return USB_ERROR;
}


/**
  * @brief  EndPoint error handler sample.
  * @note   This function interface reflects EndPoint error handler
  *         requirements. When called on IN transaction error:
  *          - if it hasn't start another transaction and returns USB_SUCCESS,
  *            then retry of data transmission would occur;
  *          - if it returns error code, EndPoint would be switched to
  *            NAK/STALL state.
  * @param  EPx - @ref USB_EP_TypeDef - USB EndPoint number.
  *         This parameter can be one of the following values:
  *             USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  * @param  STS: USB_SEPx.STS register value.
  * @param  TS: USB_SEPx.TS register value.
  * @param  CTRL: USB_SEPx.CTRL register value.
  * @retval @ref USB_Result.
  */
USB_Result USB_DeviceDummyDataError(USB_EP_TypeDef EPx, uint32_t STS, uint32_t TS, uint32_t CTRL)
{
    return USB_ERROR;
}

/** @} */ /* End of group USB_Device_Private_Dummy_Functions */


/** @} */ /* End of group USB_Device_Private_Functions */

/** @} */ /* End of group USB_Device */

/** @} */ /* End of group USB_DEVICE_AND_CDC */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_usb_device.c */


